In [1]:
import sqlite3
import pandas as pd

I'll be working with a database called the Chinook database. It contains 11 tables pertaining to data about a fictional music store. The schema of the database is shown below.

To start, I will define some functions, via Python, that will allow us to see the results of our sqlite queries in a pandas dataframe.

In [2]:
def run_query(q):
    with sqlite3.connect('chinook.db') as conn:
        return pd.read_sql(q, conn)

In [3]:
def run_command(c):
    with sqlite3.connect('chinook.db') as conn:
        conn.isolation_level = None
        conn.execute(c)

In [8]:
def show_tables():
    query = '''SELECT
                  name,
                  type
               FROM sqlite_master
               WHERE type IN ("table","view");'''
    return run_query(query)

In [9]:
show_tables()

              name   type
0            album  table
1           artist  table
2         customer  table
3         employee  table
4            genre  table
5          invoice  table
6     invoice_line  table
7       media_type  table
8         playlist  table
9   playlist_track  table
10           track  table

For this project the